Revit 2026 API

# FilteredElementCollector(Document, ElementId) Constructor

---

Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector(
	Document document,
	ElementId viewId
)
```
```vb
Public Sub New (
	document As Document,
	viewId As ElementId
)
```
```cpp
public:
FilteredElementCollector(
	Document^ document,
	ElementId^ viewId
)
```
```fsharp
new :
        document : Document *
        viewId : ElementId -> FilteredElementCollector
```

#### Parameters

document Document
     The document that owns the view.
viewId ElementId
     The view id.

| Exception | Condition |
| --- | --- |
| ArgumentException | viewId is not a view. -or- viewId is not valid for element iteration, because it has no way of representing drawn elements. Many view templates will fail this check. |
| ArgumentNullException | A non-optional argument was null |

Elements that will be passed by the collector have graphics that may be visible in the input view. Some elements may still be hidden because they are obscured by other elements.

For elements which are outside of a crop region, they may still be passed by the collector because Revit relies on later processing to eliminate the elements hidden by the crop. This effect may more easily occur for non-rectangular crop regions, but may also happen even for rectangular crops. You can compare the boundary of the region with the element's boundary if more precise results are required.

Accessing these visible elements may require Revit to rebuild the geometry of the view. The first time your code constructs a collector for a given view, or the first time your code constructs a collector for a view whose display settings have just been changed, you may experience a significant performance degradation.

#### Reference

FilteredElementCollector Class

FilteredElementCollector Overload

Autodesk.Revit.DB Namespace